import BarChart from './components/BarChart';

function App() {
  return (
    <main>
      <h1>สถิติประชากรกรุงเทพฯ พ.ศ. 2550 - 2559</h1>
      <h3>ลักษณะพื้นที่</h3>
      <p>
        กรุงเทพฯ เป็นจังหวัดที่มีประชากรมากที่สุดในประเทศไทย
        หากรวมประชากรแฝงที่ไม่ปรากฏในทะเบียนและคนที่
        เดินทางมาทำงานในตอนกลางวันด้วยแล้ว
        คาดว่าจะสูงถึงเกือบเท่าตัวของประชากรที่ปรากฏในทะเบียน เราจึง
        เรียกกรุงเทพฯ ว่าเป็น <a href="https://en.wikipedia.org/wiki/Megacity" target="_blank">“อภิมหานคร (megacity)”</a> คือมีประชากรตั้งแต่ 10
        ล้านคนขึ้นไป
      </p>
      <p>
        อัตราเพิ่มของประชากรกรุงเทพฯ อยู่ระดับเกือบ 1% และเริ่มลดลงในปี 2559
        ดังแสดงในแผนภูมิต่อไปนี้
      </p>
      <h3>การเติบโต</h3>
      <BarChart />
      <h3>แหล่งข้อมูล</h3>
      <ul>
        <li>
          <a href="https://stat.bora.dopa.go.th/stat/statnew/statMONTH/statmonth/" target="_blank">
            สำนักบริหารการทะเบียน กรมการปกครอง กระทรวงมหาดไทย, จำนวนประชากร,
            สำนักบริหารการทะเบียน กรมการปกครอง กระทรวงมหาดไทย, Editor. 2564:
            กรุงเทพฯ.
          </a>
        </li>
        <li>
          <a href="http://www.nso.go.th/" target="_blank">
          สำนักงานสถิติแห่งชาติ, การสำรวจภาวะเศรษฐกิจและสังคมของครัวเรือน พ.ศ.
          2563 สำนักงานสถิติแห่งชาติ, Editor. 2563: กรุงเทพฯ
          </a>
        </li>
        <li>
          <a href="http://www.price.moc.go.th/" target="_blank">
          สำนักดัชนีเศรษฐกิจการค้า กระทรวงพาณิชย์,
          ข้อมูลดัชนีราคาผู้บริโภคทั่วไป, สำนักดัชนีเศรษฐกิจการค้า
          กระทรวงพาณิชย์, Editor. 2563: กรุงเทพฯ.
          </a>
        </li>
      </ul>
    </main>
  );
}

export default App
